//1039 到底买不买(20 分)
//小红想买些珠子做一串自己喜欢的珠串。卖珠子的摊主有很多串五颜六色的珠串，但是不肯把任何一串拆散了卖。于是小红要你帮忙判断一下，某串珠子里是否包含了全部自己想要的珠子？如果是，
//那么告诉她有多少多余的珠子；如果不是，那么告诉她缺了多少珠子。
//为方便起见，我们用[0 - 9]、[a - z]、[A - Z]范围内的字符来表示颜色。例如在图1中，第3串是小红想做的珠串；那么第1串可以买，
//因为包含了全部她想要的珠子，还多了8颗不需要的珠子；第2串不能买，因为没有黑色珠子，并且少了一颗红色的珠子。
//输入格式：
//每个输入包含 1 个测试用例。每个测试用例分别在 2 行中先后给出摊主的珠串和小红想做的珠串，两串都不超过 1000 个珠子。
//输出格式：
//如果可以买，则在一行中输出 Yes 以及有多少多余的珠子；如果不可以买，则在一行中输出 No 以及缺了多少珠子。其间以 1 个空格分隔。
//输入样例 1：
//ppRYYGrrYBR2258
//YrR8RrY
//输出样例 1：
//Yes 8
//
//代码思路：要求买到全部都包含的珠子，将两个输入用数组表示，遍历比较两个字符串是否
//相同的字符，将有的珠子标记出来，如果全部相同都标记了则输出yes,有不相同则输出NO

//AC代码如下
#if 0
#include<stdio.h>
#include<string.h>
int main()
{
	char arr1[1001], arr2[1001];
	int count = 0;
	scanf("%s\n%s", arr1, arr2);
	int l1 = strlen(arr1), l2 = strlen(arr2);
	for (int i = 0; i < l1; i++)
	{
		for (int j = 0; j < l2; j++)
		{
			if (arr1[i] == arr2[j])
			{
				arr2[j] = '*';
				count++;
				break;
			}
		}
	}
		if (count == l2)
		{
			printf("YES %d\n", l1 - l2);
		}
		else
			printf("NO %d\n", l2 - count);
	return 0;
}
#endif
//代码总结：这是一个相对简单的题目，主要把握住两个字符串的比较，如果字符串二
//有与字符串一有相同的字符，则将其标记出来，遍历两个字符串。将标记的数量与字符串2
//作比较，如果相同则满足条件，输出yes，反之，则输出No；
