//1027 打印沙漏(20 分)
//本题要求你写个程序把给定的符号打印成沙漏的形状。例如给定17个“*”，要求按下列格式打印
//
//*****
// ***
//  *
// ***
//*****
//所谓“沙漏形状”，是指每行输出奇数个符号；各行符号中心对齐；相邻两行符号数差2；符号数先从大到小顺序递减到1，再从小到大顺序递增；首尾符号数相等。
//
//给定任意N个符号，不一定能正好组成一个沙漏。要求打印出的沙漏能用掉尽可能多的符号。
//输入样例:
//19 *
//输出样例 :
//*****
// ***
//	*
// ***
//*****
//  2

//解题思路：首先要找规律，要形成不同的沙漏，需要*的个数是，1，7，31... 所以an=2*n*n+2;
//知道了其输出行数，接下来就是每一行的打印了，比如沙漏是一个倒型的，可以把他分为两部分，一部分
//递增，一部分递减，注意下面这部分少了第一行；从上到下打印，每行的空格先从零的到n，再从n到零。
//每行的*的个数由2n-1，该题目应该注意输入的符号数N与沙漏的大小的关系。

//AC代码如下：
#if 0
#include<stdio.h>
#include<math.h>
int main()
{
	int N = 0, n;
	char m;
	scanf("%d%c", &N, &m);//在gcc上%d和%c要分开，不然会出错
	n = sqrt((N + 1) / 2);
	for (int i = n; i > 0; i--)//打印沙漏的上部分，打印n行
	{
		for (int j = 0; j < n - i; j++)//首先打印空格
		{
			printf(" ");

		}
		for (int j = 0; j < 2 * i - 1; j++)//其次打印*
		{
			printf("%c", m);
		}
		printf("\n");
	}
	for (int i = 2; i <= n; i++)//打印上部分，从小到大，打印n-1行
	{
		for (int j = 0; j < n - i; j++)//首先打印空格
		{
			printf(" ");

		}

		for (int j = 0; j < 2 * i - 1; j++)//其次打印*
		{

			printf("%c", m);

		}

		printf("\n");
	}
	int s = N - 2 * n*n + 1;
	printf("%d", s);
	return 0;
}






#endif