//1032 挖掘机技术哪家强(20 分)
//为了用事实说明挖掘机技术到底哪家强，PAT 组织了一场挖掘机技能大赛。现请你根据比赛结果统计出技术最强的那个学校。
//输入格式：
//输入在第 1 行给出不超过 10^5的正整数 N，即参赛人数。随后 N 行，每行给出一位参赛者的信息和成绩，包括其所代表的学
//校的编号（从 1 开始连续编号）、及其比赛成绩（百分制），中间以空格分隔。
//输出格式：
//在一行中给出总得分最高的学校的编号、及其总分，中间以空格分隔。题目保证答案唯一，没有并列。
//
//输入样例：
//6
//3 65
//2 80
//1 100
//2 70
//3 40
//3 0
//输出样例：
//2 150

//解题思路：要求输出一个最强的学校，一个学校有一个或多个参赛选手，判断的依据是学校的得到的最高分
//解题的关键应该用数组表示参赛人数及各参赛人员的所在学校以及其得分；最后输出得分最高的学校及其总分
//学校的个数小于等于参赛人员
//AC代码如下：
#if 0
#include<stdio.h>
int main()
{
	int m = 0;
	int max = 0;
	int N;
	scanf("%d", &N);
	int arr1[100000];
	for (int i = 0; i <=N; i++)  arr1[i] = 0;//记得初始化这个数组
	for (int i = 0; i < N; i++)
	{
		int a = 0, b = 0;
		scanf("%d %d", &a, &b);
		arr1[a] += b;
	}
	for (int j = 1; j <= N; j++)
	{

		if (max < arr1[j])
		{
			max = arr1[j];
			m = j;
		}
	}
	printf("%d %d", m, max);
	return 0;
}
#endif

